Repository: rustcc/rust-zh
Catalog: rust-zh-translating/omegat/project_save.tmx
Source language: en_us
Languages: zh

source: We're working on it!
zh: 我们还在努力改进。

source: We've successfully built `hello_world` with Cargo.
zh: 好了！我们已经成功地使用 Carge 构建了 `hello_world`。

source: Welcome to the Rust guide.
zh: 欢迎阅读本 Rust 入门教程。

source: Welcome.
zh: 欢迎！

source: Which, at this point, is often.
zh: 在现阶段可能会比较频繁的升级。

source: With Cargo, as our project grows, we can just `cargo build` and it'll work the right way.
zh: 而使用 Cargo，随着项目增长，我们仍然只需要敲 `cargo build` 就可以了，它会工作得很好。

source: With that said, let's make a directory in our projects directory.
zh: 闲话说完了，我们就先创建一个工程目录。

source: You add a line to your `Cargo.toml`:
zh: 只需要在`Cargo.toml`文件里添加两行声明（[dependencies.*]）：

source: You added the `semver` library, which parses version numbers and compares them according to the [SemVer specification](http://semver.org/).
zh: 这里添加的依赖项，是`semver`库，用于解析和比较版本号，详见 [SemVer规范](http://semver.org/)。

source: You can also run these examples on [play.rust-lang.org](http://play.rust-lang.org/) by clicking on the arrow that appears in the upper right of the example when you mouse over the code.
zh: 你也可以在[play.rust-lang.org](http://play.rust-lang.org/)里面运行以上代码，只需把鼠标移到代码块上点击右上角的箭头链接。

source: You can re-run this script any time you want to update Rust.
zh: 在任何时候，你都可以重新执行这个脚本来升级 Rust。

source: You can see it with `ls`:
zh: 你可以输入 `ls` 查看：

source: You have officially written a Rust program.
zh: 你已经正式写完了一个 Rust 程序。

source: You should see some output that looks something like this:
zh: 您会看到类似如下的输出：

source: You won't ever need to touch this file yourself, just let Cargo handle it.
zh: 不要自己去创建这个文件，留给 Cargo 去处理。

source: You'll also note that the function is wrapped in curly braces (`{` and `}`).
zh: 你可能还注意到了，函数体是由花括号 `{` 和 `}` 包起来的。

source: You'll also notice that Cargo has created a new file: `Cargo.lock`.
zh: 你会注意到 Cargo 生成了一个新文件，`Cargo.lock`：

source: You'll learn more when we talk about macros later.
zh: 等后面讲到宏时再说。

source: [Cargo](http://crates.io) is a tool that Rustaceans use to help manage their Rust projects.
zh: [Cargo](http://crates.io) 是用来辅助管理 Rust 项目的工具。

source: `hello_world.rs` rather than `helloworld.rs`.
zh: `hello_world.rs`而不是`helloworld.rs`。
